In [1]:
import numpy as np
import pandas as pd

In [2]:
df5 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]})
df5

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [5]:
df_t = df5.iloc[:,1:5]

In [7]:
df_t.transform(lambda x : (x-x.mean())/x.std())

       var1      var2
0 -0.687871 -0.738461
1 -0.299074 -0.263736
2  0.000000 -0.015514
3 -0.328982 -0.235811
4 -0.657963 -0.704331
5  1.973890  1.957853

In [10]:
(df_t.iloc[0,0] - df_t.var1.mean()) / df_t.var1.std()

-0.6878708952377661

In [11]:
df_t.var1.mean()

33.0

In [12]:
df_t.var1.std()

33.436506994600975

In [13]:
df_t.transform(lambda x : np.log(x))

       var1      var2
0  2.302585  4.605170
1  3.135494  5.533389
2  3.496508  5.808142
3  3.091042  5.568345
4  2.397895  4.709530
5  4.595120  6.876265

In [15]:
np.log(23)

3.1354942159291497

In [16]:
df5 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]})
df5

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [17]:
df5.apply(np.sum)

groups    ABCABC
var1         198
var2        2028
dtype: object

In [19]:
df5.var1.sum()

198

In [20]:
df5.groups.sum()

'ABCABC'

In [ ]:
# df5.apply(np.median)

In [21]:
df_numeric = df5.iloc[:,1:3]

In [22]:
df_numeric

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969

In [23]:
df_numeric.apply(np.median)

var1     22.5
var2    257.5
dtype: float64

In [24]:
df_numeric.apply(np.mean)

var1     33.0
var2    338.0
dtype: float64

In [25]:
df_numeric.apply(np.mean, axis=1)

0     55.0
1    138.0
2    183.0
3    142.0
4     61.0
5    534.0
dtype: float64

In [26]:
df5.groupby("groups").apply(np.mean)

        var1   var2
groups
A       16.0  181.0
B       17.0  182.0
C       66.0  651.0

In [27]:
df5

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [28]:
df5.groupby("groups").mean()

        var1  var2
groups
A         16   181
B         17   182
C         66   651

In [29]:
df2 = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df2

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [31]:
def times2(x):
    return x*2

In [32]:
df2["col1"].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [33]:
df2["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [34]:
df2

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [35]:
df2["col3"].transform(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [36]:
df2["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [37]:
df1 = pd.DataFrame([["a", 9, 25]] * 4, columns=["grp", 'P', 'Q'])
df2 = pd.DataFrame([["b", 9, 25]] * 3, columns=["grp", 'P', 'Q'])
df3 = pd.concat([df1, df2], ignore_index=True)
df3

  grp  P   Q
0   a  9  25
1   a  9  25
2   a  9  25
3   a  9  25
4   b  9  25
5   b  9  25
6   b  9  25

In [38]:
df3.apply(lambda x : x + x)

  grp   P   Q
0  aa  18  50
1  aa  18  50
2  aa  18  50
3  aa  18  50
4  bb  18  50
5  bb  18  50
6  bb  18  50

In [39]:
df3.apply(lambda y : y + y)

  grp   P   Q
0  aa  18  50
1  aa  18  50
2  aa  18  50
3  aa  18  50
4  bb  18  50
5  bb  18  50
6  bb  18  50

In [40]:
df3

  grp  P   Q
0   a  9  25
1   a  9  25
2   a  9  25
3   a  9  25
4   b  9  25
5   b  9  25
6   b  9  25